#+Title: Practical: Development Environment
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2025-04-01
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:1
#+STARTUP: beamer num

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH2025

** Show and Tell :Demo:noexport:

- Open a file (in Emacs, in Kate): file+emacs:/home/msv/Documents/Play/Tornsvala/src/Tornsvala.java
- Contrast with the compiled file:

#+begin_src bash :results output
hexdump -C /home/msv/Documents/Play/Tornsvala/out/Tornsvala.class | head -20
#+end_src

#+RESULTS:
#+begin_example
00000000  ca fe ba be 00 00 00 43  00 60 0a 00 02 00 03 07  |.......C.`......|
00000010  00 04 0c 00 05 00 06 01  00 10 6a 61 76 61 2f 6c  |..........java/l|
00000020  61 6e 67 2f 4f 62 6a 65  63 74 01 00 06 3c 69 6e  |ang/Object...<in|
00000030  69 74 3e 01 00 03 28 29  56 07 00 08 01 00 13 6a  |it>...()V......j|
00000040  61 76 61 2f 75 74 69 6c  2f 41 72 72 61 79 4c 69  |ava/util/ArrayLi|
00000050  73 74 0a 00 07 00 03 09  00 0b 00 0c 07 00 0d 0c  |st..............|
00000060  00 0e 00 0f 01 00 09 54  6f 72 6e 73 76 61 6c 61  |.......Tornsvala|
00000070  01 00 0b 6d 79 53 69 67  68 74 69 6e 67 73 01 00  |...mySightings..|
00000080  10 4c 6a 61 76 61 2f 75  74 69 6c 2f 4c 69 73 74  |.Ljava/util/List|
00000090  3b 08 00 11 01 00 1b 53  75 70 65 72 6d 61 72 69  |;......Supermari|
000000a0  6e 65 20 53 70 69 74 66  69 72 65 20 47 2d 43 46  |ne Spitfire G-CF|
000000b0  47 4a 0b 00 13 00 14 07  00 15 0c 00 16 00 17 01  |GJ..............|
000000c0  00 0e 6a 61 76 61 2f 75  74 69 6c 2f 4c 69 73 74  |..java/util/List|
000000d0  01 00 03 61 64 64 01 00  15 28 4c 6a 61 76 61 2f  |...add...(Ljava/|
000000e0  6c 61 6e 67 2f 4f 62 6a  65 63 74 3b 29 5a 08 00  |lang/Object;)Z..|
000000f0  19 01 00 1a 4d 65 73 73  65 72 73 63 68 6d 69 74  |....Messerschmit|
00000100  74 20 42 47 31 30 39 20  44 2d 46 57 4d 45 08 00  |t BG109 D-FWME..|
00000110  1b 01 00 18 4a 75 6e 6b  65 72 20 4a 55 2d 39 37  |....Junker JU-97|
00000120  20 53 74 75 6b 61 20 52  49 2d 4a 4b 12 00 00 00  | Stuka RI-JK....|
00000130  1d 0c 00 1e 00 1f 01 00  17 6d 61 6b 65 43 6f 6e  |.........makeCon|
#+end_example
